##language: ru
#
#Функционал: Добавление ресторана
#  перехожу на страницу
#  заполняю все поля
#  подтверждаю
#  проверяю на успех
#
#  @addResto
#  Сценарий: Редактирование видео
#
#    Допустим я зашёл на страницу "user/login"
#    Если я ввожу данные:
#      | email    | admin@gmail.com |
#      | password | 12345678        |
#    И нажимаю на кнопку "войти"
#    То я вижу текст "Вы авторизированы!"
#
#    Допустим я зашёл на страницу "alga-express/wareHouses"
#    И нажимаю на кнопку "Редактировать видео"
#    Затем я ввожу данные:
#      | //*[@id="mui-1"] | "https://www.youtube.com/watch?v=5_HWXQLWYbA" |
#    И нажимаю на кнопку "Применить"
#    То я вижу текст "Видео отредактировано"